ans2 = 'Банковская тайна - сведения об операциях, о счетах и вкладах клиентов и корреспондентов ' \
       'Банка, а также об иных сведениях, установленных Банком, не противоречащих Федеральному ' \
       'закону № 395-1(ст. 26 закона «О банках и банковской деятельности»). По российскому ' \
       'законодательству кредитная организация гарантирует тайну банковского счета и банковского ' \
       'вклада, операций по счету и сведений о клиенте. \n Данные, составляющие банковскую тайну, ' \
       'предоставляются клиентам, их представителям, БКИ, АСВ, судам, Счетной палате, налоговым, ' \
       'следственным и таможенным органам, ПФР, Фонду социального страхования, судебным приставам, ' \
       'ФСФР, ФТС, следственным органам. \n Список структур, имеющих доступ к банковской тайне, постоянно ' \
       'расширяется. Государственным органам и их должностным лицам такие сведения могут быть ' \
       'предоставлены исключительно в случаях и порядке, которые предусмотрены законом. При ' \
       'разглашении банком сведений, составляющих банковскую тайну, клиент, права которого нарушены, ' \
       'может потребовать от того возмещения причиненных убытков.'
ans3_1 = '1) Банк России;\n' \
         '2) Банки;\n' \
         '3) Небанковские кредитные организации;\n' \
         '4) Агентство по страхованию вкладов, Бюро кредитных историй и другие компании, кому стала ' \
         'доступна информация, относящаяся к БТ.'
ans3_2 = 'некий план реализации конкретного действия'
ans3_3 = 'Ст. 26 ФЗ № 395-1 «О банках и банковской деятельности» - Кредитная организация, Банк России, ' \
         'организация, осуществляющая функции по обязательному страхованию вкладов, гарантируют тайну ' \
         'об операциях, о счетах и вкладах своих клиентов и корреспондентов. Все служащие кредитной ' \
         'организации обязаны хранить тайну об операциях, о счетах и вкладах ее клиентов и корреспондентов,' \
         ' а также об иных сведениях, устанавливаемых кредитной организацией, если это не противоречит ' \
         'федеральному закону.\n' \
         'Ст. 857 Гражданского Кодекса РФ: 1. Банк гарантирует тайну банковского счета и банковского ' \
         'вклада, операций по счету и сведений о клиенте. 2. Сведения, составляющие банковскую тайну, ' \
         'могут быть предоставлены только самим клиентам или их представителям, а также представлены ' \
         'в бюро кредитных историй на основаниях и в порядке, которые предусмотрены законом. ' \
         'Государственным органам и их должностным лицам, а также иным лицам такие сведения могут быть ' \
         'предоставлены исключительно в случаях и порядке, которые предусмотрены законом.\n' \
         'Ст. 183 Уголовного Кодекса РФ - Собирание сведений, составляющих коммерческую, налоговую или ' \
         'банковскую тайну, путем похищения документов, обмана, шантажа, принуждения, подкупа или угроз, ' \
         'а равно иным незаконным способом - наказывается штрафом в размере до пятисот тысяч рублей или ' \
         'в размере заработной платы или иного дохода осужденного за период до одного года, либо ' \
         'исправительными работами на срок до одного года, либо принудительными работами на срок до двух ' \
         'лет, либо лишением свободы на тот же срок.\n' \
         'ФЗ "О национальной платежной системе" от 27.06.2011 N 161-ФЗ - Операторы по переводу денежных ' \
         'средств, операторы платежных систем, операторы услуг платежной инфраструктуры и банковские ' \
         'платежные агенты (субагенты) обязаны гарантировать банковскую тайну в соответствии с ' \
         'законодательством Российской Федерации о банках и банковской деятельности.'
ans3_4 = '1) информационная безопасность при назначении и распределении ролей и обеспечении доверия к персоналу;\n' \
         '2) информационная безопасность автоматизированных банковских систем на стадиях жизненного цикла;\n' \
         '3) информационная безопасность при управлении доступом и регистрацией;\n' \
         '4) информационной безопасности средствами антивирусной защиты;\n' \
         '5) информационная безопасность при использовании ресурсов сети Интернет;\n' \
         '6) информационная безопасность при использовании средств криптографической защиты информации;\n' \
         '7) информационная безопасность банковских платежных технологических процессов;\n' \
         '8) информационная безопасность банковских информационных технологических процессов.'
ans4_1 = 'Согласно Федеральному Закону о Федеральной Службе Безопасности определены назначение, состав, ' \
         'правовые основы и принципы деятельности ФСБ, направления деятельности, полномочия, силы и ее ' \
         'средства. \n' \
         'В рамках надзора за органами защиты банковской тайны ФСБ наделен полномочиями:\n' \
         '1) выявлять, предупреждать, пресекать разведывательную и иную деятельность специальных служб и ' \
         'организаций иностранных государств, а также отдельных лиц;\n' \
         '2) разрабатывать и осуществлять во взаимодействии с другими государственными органами меры по ' \
         'борьбе с коррупцией;\n' \
         '3) выявлять, предупреждать, пресекать и раскрывать преступления, дознание и предварительное ' \
         'следствие по которым отнесены законодательством Российской Федерации к ведению органов ' \
         'федеральной службы безопасности;'
ans4_2 = 'Роспотребнадзор наделен контрольно-надзорными полномочиями в области защиты прав потребителей ' \
         'согласно Федеральному закону от 21 декабря 2013 года № 353-ФЗ «О потребительском кредите (займе)».\n' \
         'Роспотребнадзор:\n' \
         '1) обосновывает требования к участникам потребительского рынка – исполнителям финансовых услуг, ' \
         'связанных с предоставлением кредитов (займов) гражданам;\n' \
         '2) проводит проверки в кредитных организациях как по претензиям клиентов, так и по собственной ' \
         'инициативе;\n' \
         '3) вправе давать разъяснения по вопросам применения законов и иных нормативных правовых актов ' \
         'Российской Федерации, регулирующих отношения в области защиты прав потребителей;\n' \
         '4) имеет возможность осуществлять деятельность в рамках своей компетенции во взаимодействии с ' \
         'другими федеральными органами исполнительной власти, органами исполнительной власти субъектов ' \
         'Российской Федерации, органами местного самоуправления.'
ans4_3 = 'ФСТЭК является федеральным органом исполнительной власти России, осуществляющим реализацию ' \
         'государственной политики, организацию межведомственной координации и взаимодействия, специальные' \
         ' и контрольные функции в области государственной безопасности.\n' \
         '1) Согласно Приказу ФСТЭК России от 11 февраля 2013 г. № 17 ФСТЭК регламентированы требования ' \
         'о защите информации не являющейся государственной тайной;\n' \
         '2) Согласно Приказу ФСТЭК России от 25 декабря 2017 г. № 239 ФСТЭК регламентированы требования ' \
         'по обеспечении безопасности значимых объектов критической информационной инфраструктуры.'
ans4_4 = 'Банк России является органом банковского регулирования и банковского надзора в соответствии с ' \
         'Конституцией Российской Федерации и ФЗ “О Центральном банке Российской Федерации (Банке России)”.\n' \
         'Банк России:\n' \
         '1) осуществляет постоянный надзор за соблюдением кредитными организациями и банковскими группами ' \
         'законодательства Российской Федерации, нормативных актов Банка России, установленных ими ' \
         'обязательных нормативов и (или) установленных Банком России индивидуальных предельных значений ' \
         'обязательных нормативов;\n' \
         '2) осуществляет анализ деятельности банковских холдингов и использует полученную информацию для ' \
         'целей банковского надзора за кредитными организациями и банковскими группами, входящими в ' \
         'банковские холдинги. Под надзором находятся кредитные организации, расположенные во всех ' \
         'федеральных округах Российской Федерации.\n'